Repository: vlaya8/tagforest
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: anglais

source: French
fr: français

source: Name
fr: Nom

source: Text (markdown formatted)
fr: Texte (formatté en markdown)

source: Tags (separated by commas: tag1,tag2,tag3...)
fr: Tags (séparé par des virgules: tag1,tag2,tag3...)

source: Username
fr: Nom d'utilisateur

source: Default language
fr: Langage par défaut

source: Public to which your personal group is listed
fr: Public auquel votre groupe personel est listé

source: Public to which your personal group is accessible
fr: Public auquel votre groupe personel est accessible

source: %(username)s is already taken
fr: %(username)s est déjà pris

source: You asked to list the group to %(listed_public)s but it is only visible to %(visible_public)s
fr: Vous avez défini votre groupe comme listé %(listed_public)s mais il est seulement visible %(visible_public)s

source: Public to which the group is listed
fr: Public auquel votre groupe est listé

source: Public to which the group is accessible
fr: Public auquel votre groupe est accessible

source: There is no user named %(username)s
fr: Il n'y a pas d'utilisateur nommé %(username)s

source: %(username)s is already in %(group)s
fr: %(username)s est déjà dans %(group)s

source: Default entry display
fr: Affichage des entrées par défaut

source: Error when selecting entries
fr: Erreur en selectionnant les entrées

source: Data to import
fr: Données à importer

source: Parsing failed starting from line %(linenumber)s
fr: L'import a échoué à partir de la ligne %(linenumber)s

source: Only invited users
fr: Seulement les utilisateurs invités

source: Only users
fr: Seulement les utilisateurs

source: Everyone
fr: Tout le monde

source: invited users
fr: aux utilisateurs invités

source: users
fr: à tous les utilisateurs

source: everyone
fr: à tout le monde

source: Compact (small)
fr: Compact (petit)

source: Compact (medium)
fr: Compact (moyen)

source: List
fr: Liste

source: Writer
fr: Ecrivain·e

source: Reader
fr: Lecteur·ice

source: 404 error
fr: Erreur 404

source: 500 error
fr: Erreur 500

source: About
fr: A propos

source: <p> <b>Source code:</b> <a class="buttonLink" href="https://github.com/vlaya8/tagforest">https://github.com/vlaya8/tagforest</a> <br/></br> <b>Contact:</b> tagforest@protonmail.com </p>
fr: <p> <b>Code source:</b> <a class="buttonLink" href="https://github.com/vlaya8/tagforest">https://github.com/vlaya8/tagforest</a> <br/></br> <b>Contact:</b> tagforest@protonmail.com </p>

source: <h2>Description</h2> <p>Tagforest aims to share and organize knowledge and ressources by classifying them with tags</p>
fr: <h2>Description</h2> <p>Tagforest a pour but d'organiser et partager des ressources en les classifiant avec des tags</p>

source: <h2>Goals</h2> <ul> <li>Track, classify, take notes of ressources you've read / seen from different subjects</li> <li>Visualize them in one place, and share a set of knowledge from a subject to others with one link</li> <li>Create groups to collaboratively organize ressources together</li> <li>[In Progress] Visualize the different categories / movements and the way they connect to each other</li> <li>[In Progress] Merge your set of ressources and categories with someone else, or see what ressource you have in common</li> </ul>
fr: <h2>Buts</h2> <ul> <li>Tracker, classifier et prendre des notes des ressources que vous avez lu / vu sur différents sujets</li> <li>Les visualiser en un seul endroit, et partager un ensemble de connaissances d'un sujet aux autres en un seul lien</li> <li>Créer des groupes pour organiser collaborativement des ressources ensemble</li> <li>[En cours] Visualiser les différents mouvements / catégories et la manière dont ils sont liés</li> <li>[En cours] Fusionner votre ensemble de connaissance et de catégories avec quelqu'un , et / ou voir ce que vous avez en commun</li> </ul>

source: <h2>Usage Example</h2> <p> Here is an example of a tree containing music: <a href="https://www.tagforest.fr/fr/group/vlaya/tree/3/view/" class="buttonLink" >Music Tree</a> </p>
fr: <h2>Exemple d'usage</h2> <p> Un exemple d'un arbre contenant de la musique: <a href="https://www.tagforest.fr/fr/group/vlaya/tree/3/view/" class="buttonLink" >Arbre de musique</a> </p>

source: <h2>Accessibility, Privacy, Security, Content</h2> <ul> <li> [In Progress] Website accessibility: <ul> <li>should be as accessible as possible to disabled people</li> <li>should be as easy as possible to understand</li> </ul> </li> <li> [In Progress] Privacy and security: <ul> <li>Private data on this website should be free of any government spying</li> </ul> </li> <li> [In Progress] Content: <ul> <li>Radical political content should not be censored, however oppressive content is not allowed</li> </ul> </li> </ul>
fr: <h2>Accessibilité, Vie privée, Sécurité, Contenu</h2> <ul> <li> [En cours] Accessibilité du site: <ul> <li>devrait être aussi accessible que possible aux personnes handicapées</li> <li>devrait être aussi facile que possible à comprendre</li> </ul> </li> <li> [En cours] Vie privée et sécurité: <ul> <li>Le contenu privé de l'utilisateur ne devrait pas être sujet à de l'espionnage gouvernementale</li> </ul> </li> <li> [En cours] Contenu: <ul> <li>Le contenu politique radical ne devrait pas être censuré, cependant le contenu oppressif n'est pas autorisé</li> </ul> </li> </ul>

source: If something could be made more accessible, if you see a privacy / security issue, send a mail to <b>tagforest@protonmail.com</b>
fr: Si quelque chose pourrait être rendu plus accessible, si vous voyez un soucis de vie privée / sécurité , envoyez un mail à <b>tagforest@protonmail.com</b>

source: <h2>Current state</h2> <b><!--CURRENT_VERSION--> (<!--CURRENT_VERSION_DATE-->)</b> <ul> <li>User authentification system</li> <li>Groups, Trees, Entries and Tags: <ul> <li> A group contains multiple users</li> <li> Trees can be added to a group</li> <li> A tree contains a list of entries and tags</li> <li> Each entry can have multiple tags</li> <li> In a tree, entries can be sorted by tags, and tags are sorted by entry count</li> <li> An entry can contain markdown formatted text, and the markdown is rendered when viewing it</li> </ul> </li> </ul>
fr: <h2>Etat actuel</h2> <b><!--CURRENT_VERSION--> (<!--CURRENT_VERSION_DATE-->)</b> <ul> <li>Système d'authentification</li> <li>Groupes, arbres, entrées et tags <ul> <li> Un groupe contient plusieurs utilisateurs</li> <li> Des arbres peuvent être ajoutés à un groupe</li> <li> Un arbre contient une liste d'entrées et de tags</li> <li> Chaque entrée peut avoir plusieurs tags</li> <li> Dans un arbre, les entrées peuvent être triées par tags, et les tags sont triés par nombre d'entrées</li> <li> Une entrée peut contenir du texte formatté en markdown, et le markdown est rendu lorsqu'on la visualise</li> </ul> </li> </ul>

source: <h2>Upcoming</h2> <ul> <li>Public link generation: generate a link for a single tree or a set of trees, to have full control over what you share</li> <li>Tag name fuzzyness: each tag has a set of names which will be considered to lead to the same tag</li> <li>Directed Acyclic Graph (DAG) of tags: tags are related to each other through a DAG</li> <li>More fields for each entry, and different types of tags</li> <li>Multiple color schemes</li> </ul>
fr: <h2>A venir</h2> <ul> <li>Génération de lien public: générer un lien pour un arbre ou un ensemble d'arbres, pour avoir un total contrôle sur ce qu'on partage</li> <li>Noms de tags approximatifs: chaque tag a un ensemble de noms considérés comme menant au même tag</li> <li>Graphe acyclique orienté (DAG) de tags: les tags sont liés entre eux à travers un DAG</li> <li>Plus de champs pour les entrées, et différents types de tags</li> <li>Plusieurs thèmes de couleurs</li> </ul>

source: <h2>Tools / Languages / Frameworks used</h2> <b>Website developpment:</b> <ul> <li>Languages: <b>Python 3, HTML, CSS, Javascript</b></li> <li><a class="buttonLink" href="https://www.djangoproject.com/" >Django:</a> main framework, django modules used: django-notifications-hq, django-dag (upcoming)</li> <li><a class="buttonLink" href="https://vuejs.org/" >VueJS:</a> for small javascript apps throughout the website, vue modules used: vue-markdown, vue-click-outside</li> <li><a class="buttonLink" href="https://sass-lang.com/" >Sass:</a> CSS preprocessing</li> </ul> <b>Server:</b> <ul> <li>OS: <a class="buttonLink" href="https://www.debian.org/" >Debian Buster 10</a></li> <li>Hosted by <a class="buttonLink" href="https://www.ovh.com/" >OVH</a> on a Virtual Private Server</li> <li>HTTP server with <a class="buttonLink" href="https://gunicorn.org/" >Gunicorn</a> and <a class="buttonLink" href="http://nginx.org/" >Nginx</a></li> <li>SQL database: <a class="buttonLink" href="http://postgresql.org/" >PostgreSQL</a></li> </ul>
fr: <h2>Outils / Langages / Frameworks utilisés</h2> <b>Développement du site:</b> <ul> <li>Langages: <b>Python 3, HTML, CSS, Javascript</b></li> <li><a class="buttonLink" href="https://www.djangoproject.com/" >Django:</a> framework principal, modules django modules utilisés: django-notifications-hq, django-dag (à venir)</li> <li><a class="buttonLink" href="https://vuejs.org/" >VueJS:</a> pour de petites apps javascript à diverses endroits du site, modules vue utilisés: vue-markdown, vue-click-outside</li> <li><a class="buttonLink" href="https://sass-lang.com/" >Sass:</a> prétraitement CSS </li> </ul> <b>Serveur:</b> <ul> <li>OS: <a class="buttonLink" href="https://www.debian.org/" >Debian Buster 10</a></li> <li>Hébergé par <a class="buttonLink" href="https://www.ovh.com/" >OVH</a> sur un serveur privé virtuel</li> <li>serveur HTTP avec <a class="buttonLink" href="https://gunicorn.org/" >Gunicorn</a> et <a class="buttonLink" href="http://nginx.org/" >Nginx</a></li> <li>Base de donnée SQL: <a class="buttonLink" href="http://postgresql.org/" >PostgreSQL</a></li> </ul>

source: Groups
fr: Groupes

source: Personal Trees
fr: Arbres personels

source: Login
fr: Se connecter

source: No new notifications
fr: Aucune nouvelle notification

source: View all notifications
fr: Voir toutes les notifications

source: Tree parameters
fr: Paramètres de l'arbre

source: Entry display:
fr: Affichage des entrées

source: Remove from saved
fr: Enlever des groupes sauvegardés

source: Save Group
fr: Sauvegarder le groupe

source: Tree Parameters
fr: Paramètres de l'arbre

source: Submit
fr: Soumettre

source: Cancel
fr: Annuler

source: Add
fr: Ajouter

source: Quick add
fr: Ajout rapide

source: Select
fr: Selectionner

source: Remove
fr: Supprimer

source: Import entries
fr: Importer des entrées

source: Export entries
fr: Exporter les entrées

source: View profile
fr: Voir le profile

source: View group info
fr: Voir les infos du groupe

source: You can then import these entries back in any tree you want
fr: Vous pouvez ensuite importer ces entrées dans l'arbre que vous voulez

source: Format for importing entries (you can export a tree to see more examples):
fr: Format pour importer des entrées (vous pouvez exporter un arbre pour voir plus d'exemples):

source: Entry name
fr: Nom de l'entrée

source: Entry text
fr: Texte de l'entrée

source: Next entry
fr: Entrée suivante

source: (In the case you want to somehow import four single guillemets on a single line in the entry text, you'll have to escape it with a backslash: \<<<<)
fr: (Dans le cas ou vous voulez importer 4 chevrons successifs sur une seule ligne dans un texte d'entrée, il faudra l'échapper avec un antislash: \<<<<)

source: Permission error
fr: Erreur de permission

source: Your account doesn't have access to this page. To proceed, please login with an account that has access.
fr: Votre compte n'a pas accès à cette page. Pour continuer, veuillez de vous connecter avec un compte qui a accès.

source: Please login to see this page.
fr: Veullez vous connecter pour voir cette page

source: Your username and password didn't match. Please try again.
fr: Votre nom d'utilisateur et mot de passe ne correspondent pas. Veuillez essayer à nouveau.

source: Sign Up
fr: S'inscrire

source: Change password
fr: Changer le mot de passe

source: Personal Group
fr: Group personel

source: Logout
fr: Se déconnecter

source: Personal group visibility settings
fr: Paramètres de visibilité du groupe personel

source: Personal group is visible to <b>%(group_visible_to)s</b> and listed to <b>%(group_listed_to)s</b>
fr: Le groupe personel est visible <b>%(group_visible_to)s</b> et listé <b>%(group_listed_to)s</b>

source: Edit profile
fr: Editer le profile

source: Sign-up
fr: S'inscrire

source: <p> Passwords are hashed using <a href="https://en.wikipedia.org/wiki/PBKDF2" >PBKDF2</a>, which ensures no one can view it, even with access to the website's database<br/> More information on how passwords are stored can be found <a href="https://docs.djangoproject.com/en/3.0/topics/auth/passwords/" >here</a> </p>
fr: <p> Les mots de passes sont hashés avec <a href="https://en.wikipedia.org/wiki/PBKDF2" >PBKDF2</a>, ce qui assure que personne ne peut le voir, même en ayant accès à là base de donnée du site<br/> Plus d'informations sur comment les mots de passes sont stockés peuvent être trouvées <a href="https://docs.djangoproject.com/en/3.0/topics/auth/passwords/" >ici</a> </p>

source: Successful registration
fr: Inscription réussie

source: Registration successful, you may now <a href="%(login_url)s?next=%(post_login_url)s" >login</a>.
fr: Inscription réussie, vous pouvez maintenant <a href="%(login_url)s?next=%(post_login_url)s" >vous connecter</a>.

source: Add entry
fr: Ajouter une entrée

source: <h2>Add an entry</h2> <p> Entry text can be formatted in <a href="https://www.markdownguide.org/getting-started/" >markdown</a><br/> Here is an example to quickly understand what markdown means: <a href="https://www.tagforest.fr/fr/group/Examples/tree/9/entry/173/view/?" class="buttonLink" >Markdown example</a> </p>
fr: <h2>Ajouter une entrée</h2> <p> Le texte peut être formatté en <a href="https://www.markdownguide.org/getting-started/" >markdown</a><br/> Voici un exemple pour rapidement comprendre ce qu'est le markdown: <a href="https://www.tagforest.fr/fr/group/Examples/tree/9/entry/173/view/?" class="buttonLink" >Exemple de markdown</a> </p>

source: Add group
fr: Ajouter un groupe

source: Edit
fr: Editer

source: View trees
fr: Voir les arbres

source: <h2>Group visibility settings</h2> <p> Group is visible to <b>%(group_visible_to)s</b> and listed to <b>%(group_listed_to)s</b> </p> <h2>Members</h2>
fr: <h2>Paramètres de visibilité du groupe</h2> <p> Le groupe est visible <b>%(group_visible_to)s</b> et listé <b>%(group_listed_to)s</b> </p> <h2>Membres</h2>

source: Invite a member:
fr: Inviter un membre

source: Saved groups:
fr: Groupes sauvegardés

source: Joined groups:
fr: Groupes rejoints

source: <p> <a href="%(login_url)s?next=%(post_login_url)s" >Login or sign up</a> to create trees, groups, and add tags and ressources </p> <p> See the <a href="%(about_url)s" >About</a> section for information on this website </p>
fr: <p> <a href="%(login_url)s?next=%(post_login_url)s" >Connectez vous ou inscrivez vous</a> pour pouvoir créer des arbres, groupes, et ajouter des tags et ressources </p> <p> Regardez la section <a href="%(about_url)s" >A propos</a> pour plus d'informations sur ce site </p>

source: Public listed groups:
fr: Groupes publics

source: There are no public groups at the moment
fr: Il n'y a pas de groupes publics pour l'instant

source: Accept
fr: Accepter

source: Decline
fr: Refuser

source: Unread:
fr: Non lus

source: Read:
fr: Lus:

source: This group doesn't exist anymore
fr: Ce groupe n'existe plus

source: There are no entries in this tree, add one with the <b>Add</b> or <b>Quick Add</b> button
fr: Il n'y a pas d'entrées dans cet arbre, ajoutez en avec le bouton <b>Ajouter</b> ou <b>Ajout rapide</b>

source: You don't have permission to view this group's trees
fr: Vous n'avez pas la permission de voir les arbres de ce groupe

source: You don't have permission to edit in this group
fr: Vous n'avez pas la permission d'éditer ce groupe

source: Your group already contains a tree named %s(treename)s
fr: Votre groupe contient déjà un arbre nommé %s(treename)s

source: <Removed group>
fr: <Groupe supprimé>

source: %(user)s invited you to join %(group)s
fr: %(user)s vous a invité à rejoindre %(group)s

source: The group you were invited to got deleted
fr: Le groupe auquel vous aviez été invité a été supprimé

source: You don't have permission to edit this profile
fr: Vous n'avez pas la permission d'éditer ce profil

source: You don't have permission to delete this group
fr: Vous n'avez pas la permission de supprimer ce groupe

source: You can't delete this group
fr: Vous ne pouvez pas supprimer ce groupe

source: You don't have permission to edit this group
fr: Vous n'avez pas la permission d'éditer ce groupe

source: You don't have permission to view this group
fr: Vous n'avez pas la permission de voir ce groupe

source: You don't have admin permission for this group
fr: Vous n'avez pas de permission admin pour ce groupe

source: The last member of the group can't be deleted (delete the group instead)
fr: Le dernier membre du groupe ne peut pas être supprimé (supprimez plutôt le groupe)

source: The tag %(tagname)s does not exist
fr: Le tag %(tagname)s n'existe pas

source: You already have an entry named %(entryname)s
fr: Vous avez déjà une entrée nommée %(entryname)s
